In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [5]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print (df)

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
data1=[['Alex',10],['Bob',12],['Char',13]]
df=pd.DataFrame(data1)
print (df)

      0   1
0  Alex  10
1   Bob  12
2  Char  13

In [8]:
data1=[['Alex',10],['Bob',12],['Char',13]]
df=pd.DataFrame(data1,columns=['Name','Age'],dtype=float)
print (df)

   Name   Age
0  Alex  10.0
1   Bob  12.0
2  Char  13.0

In [13]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [24]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20,'d':30}]
df = pd.DataFrame(data)
df

   a   b     c     d
0  1   2   NaN   NaN
1  5  10  20.0  30.0

In [26]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [37]:
data=[{'a':5,'b':10,'c':20}]
#With two column indices, values same as dictionary keys
df1=pd.DataFrame(data,index=['first','second'],columns=['a','b'])
#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a','b','b1','c'])

df1

        a   b
first   5  10
second  5  10

In [38]:
df2

        a   b  b1   c
first   5  10 NaN  20
second  5  10 NaN  20

In [43]:
#Dictionary of Series can be passed to form a DataFrame. The resultant index is the union of all the series indexes passed
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

Note − Observe, for the series one, there is no label ‘d’ passed, but in the result, for the d label, NaN is appended with NaN.

Let us now understand column selection, addition, and deletion through examples.

In [44]:
df.one

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [55]:
# Adding a new column to an existing DataFrame object with column label by passing new series

print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','c','b'])
df

Adding a new column by passing as Series:

   one  two  three
a  1.0    1   10.0
b  2.0    2   30.0
c  3.0    3   20.0
d  NaN    4    NaN

In [57]:

print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']-df['two']

df

Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a  1.0    1   10.0  10.0
b  2.0    2   30.0  30.0
c  3.0    3   20.0  20.0
d  NaN    4    NaN   NaN

Column Deletion
Columns can be deleted or popped; let us take an example to understand how.

In [74]:
# Using the previous DataFrame, we will delete a column
# using del function
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}
df=pd.DataFrame(d)
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [75]:
del df['two']

In [65]:
df

   one  three
a  1.0   10.0
b  2.0   20.0
c  3.0   30.0
d  NaN    NaN

In [76]:
df.pop('one')

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [77]:
df

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [82]:
#Rows can be selected by passing row label to a loc function
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [83]:
df.loc['b']

one    2.0
two    2.0
Name: b, dtype: float64

In [85]:
#Rows can be selected by passing integer location to an iloc function.
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df.iloc[2]

one    3.0
two    3.0
Name: c, dtype: float64

Slice Rows
Multiple rows can be selected using ‘ : ’ operator.

In [87]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [98]:
#Multiple rows can be selected using ‘ : ’ operator.
df[1:4]

   one  two
b  2.0    2
c  3.0    3
d  NaN    4

In [102]:
df=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[4,5],[6,7]],columns=['a','b'])
df,'/n',df2

(   a  b
 0  1  2
 1  3  4,
 '/n',
    a  b
 0  4  5
 1  6  7)

In [104]:
#append
df=df.append(df2)
df

   a  b
0  1  2
1  3  4
0  4  5
1  6  7
0  4  5
1  6  7

In [113]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df,'',df2

(   a  b
 0  1  2
 1  3  4,
 '',
    a  b
 0  5  6
 1  7  8)

In [114]:
df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [115]:
#Use index label to delete or drop rows from a DataFrame
df=df.drop(0)
df

   a  b
1  3  4
1  7  8